name: "caffe_modelzoo_llama_2_attn_blocks_no_embeddings"
is_converted: true
platform_target: "Ara2"
layer {
  name: "position_ids"
  type: "Input"
  top: "position_ids"
  base_type: "Input"
  estimator_group: "Input"
  input_param {
    shape {
      dim: 1
      dim: 256
    }
    layout: "NCH"
  }
}
layer {
  name: "input_ids"
  type: "Input"
  top: "input_ids"
  base_type: "Input"
  estimator_group: "Input"
  input_param {
    shape {
      dim: 1
      dim: 256
    }
    layout: "NCH"
  }
}
layer {
  name: "_model_Where_3_output_0"
  type: "Input"
  top: "_model_Where_3_output_0"
  base_type: "Input"
  estimator_group: "Input"
  input_param {
    shape {
      dim: 1
      dim: 1
      dim: 1
      dim: 1
    }
    layout: "NCH"
  }
}
layer {
  name: "DummyData1"
  type: "Ara2DummyData"
  top: "DummyData1"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData10"
  type: "Ara2DummyData"
  top: "DummyData10"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData100"
  type: "Ara2DummyData"
  top: "DummyData100"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData101"
  type: "Ara2DummyData"
  top: "DummyData101"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData102"
  type: "Ara2DummyData"
  top: "DummyData102"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData103"
  type: "Ara2DummyData"
  top: "DummyData103"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData104"
  type: "Ara2DummyData"
  top: "DummyData104"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData105"
  type: "Ara2DummyData"
  top: "DummyData105"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData106"
  type: "Ara2DummyData"
  top: "DummyData106"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData107"
  type: "Ara2DummyData"
  top: "DummyData107"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData108"
  type: "Ara2DummyData"
  top: "DummyData108"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData109"
  type: "Ara2DummyData"
  top: "DummyData109"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData11"
  type: "Ara2DummyData"
  top: "DummyData11"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData110"
  type: "Ara2DummyData"
  top: "DummyData110"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData111"
  type: "Ara2DummyData"
  top: "DummyData111"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData112"
  type: "Ara2DummyData"
  top: "DummyData112"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData113"
  type: "Ara2DummyData"
  top: "DummyData113"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData114"
  type: "Ara2DummyData"
  top: "DummyData114"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData115"
  type: "Ara2DummyData"
  top: "DummyData115"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData116"
  type: "Ara2DummyData"
  top: "DummyData116"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData117"
  type: "Ara2DummyData"
  top: "DummyData117"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData118"
  type: "Ara2DummyData"
  top: "DummyData118"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData119"
  type: "Ara2DummyData"
  top: "DummyData119"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData12"
  type: "Ara2DummyData"
  top: "DummyData12"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData120"
  type: "Ara2DummyData"
  top: "DummyData120"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData121"
  type: "Ara2DummyData"
  top: "DummyData121"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData122"
  type: "Ara2DummyData"
  top: "DummyData122"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData123"
  type: "Ara2DummyData"
  top: "DummyData123"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData124"
  type: "Ara2DummyData"
  top: "DummyData124"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData125"
  type: "Ara2DummyData"
  top: "DummyData125"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData126"
  type: "Ara2DummyData"
  top: "DummyData126"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData127"
  type: "Ara2DummyData"
  top: "DummyData127"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData128"
  type: "Ara2DummyData"
  top: "DummyData128"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData13"
  type: "Ara2DummyData"
  top: "DummyData13"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData14"
  type: "Ara2DummyData"
  top: "DummyData14"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData15"
  type: "Ara2DummyData"
  top: "DummyData15"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData16"
  type: "Ara2DummyData"
  top: "DummyData16"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData17"
  type: "Ara2DummyData"
  top: "DummyData17"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData18"
  type: "Ara2DummyData"
  top: "DummyData18"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData19"
  type: "Ara2DummyData"
  top: "DummyData19"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData2"
  type: "Ara2DummyData"
  top: "DummyData2"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData20"
  type: "Ara2DummyData"
  top: "DummyData20"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData21"
  type: "Ara2DummyData"
  top: "DummyData21"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData22"
  type: "Ara2DummyData"
  top: "DummyData22"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData23"
  type: "Ara2DummyData"
  top: "DummyData23"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData24"
  type: "Ara2DummyData"
  top: "DummyData24"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData25"
  type: "Ara2DummyData"
  top: "DummyData25"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData26"
  type: "Ara2DummyData"
  top: "DummyData26"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData27"
  type: "Ara2DummyData"
  top: "DummyData27"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData28"
  type: "Ara2DummyData"
  top: "DummyData28"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData29"
  type: "Ara2DummyData"
  top: "DummyData29"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData3"
  type: "Ara2DummyData"
  top: "DummyData3"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData30"
  type: "Ara2DummyData"
  top: "DummyData30"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData31"
  type: "Ara2DummyData"
  top: "DummyData31"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData32"
  type: "Ara2DummyData"
  top: "DummyData32"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData33"
  type: "Ara2DummyData"
  top: "DummyData33"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData34"
  type: "Ara2DummyData"
  top: "DummyData34"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData35"
  type: "Ara2DummyData"
  top: "DummyData35"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData36"
  type: "Ara2DummyData"
  top: "DummyData36"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData37"
  type: "Ara2DummyData"
  top: "DummyData37"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData38"
  type: "Ara2DummyData"
  top: "DummyData38"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData39"
  type: "Ara2DummyData"
  top: "DummyData39"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData4"
  type: "Ara2DummyData"
  top: "DummyData4"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData40"
  type: "Ara2DummyData"
  top: "DummyData40"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData41"
  type: "Ara2DummyData"
  top: "DummyData41"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData42"
  type: "Ara2DummyData"
  top: "DummyData42"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData43"
  type: "Ara2DummyData"
  top: "DummyData43"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData44"
  type: "Ara2DummyData"
  top: "DummyData44"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData45"
  type: "Ara2DummyData"
  top: "DummyData45"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData46"
  type: "Ara2DummyData"
  top: "DummyData46"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData47"
  type: "Ara2DummyData"
  top: "DummyData47"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData48"
  type: "Ara2DummyData"
  top: "DummyData48"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData49"
  type: "Ara2DummyData"
  top: "DummyData49"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData5"
  type: "Ara2DummyData"
  top: "DummyData5"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData50"
  type: "Ara2DummyData"
  top: "DummyData50"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData51"
  type: "Ara2DummyData"
  top: "DummyData51"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData52"
  type: "Ara2DummyData"
  top: "DummyData52"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData53"
  type: "Ara2DummyData"
  top: "DummyData53"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData54"
  type: "Ara2DummyData"
  top: "DummyData54"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData55"
  type: "Ara2DummyData"
  top: "DummyData55"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData56"
  type: "Ara2DummyData"
  top: "DummyData56"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData57"
  type: "Ara2DummyData"
  top: "DummyData57"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData58"
  type: "Ara2DummyData"
  top: "DummyData58"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData59"
  type: "Ara2DummyData"
  top: "DummyData59"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData6"
  type: "Ara2DummyData"
  top: "DummyData6"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData60"
  type: "Ara2DummyData"
  top: "DummyData60"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData61"
  type: "Ara2DummyData"
  top: "DummyData61"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData62"
  type: "Ara2DummyData"
  top: "DummyData62"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData63"
  type: "Ara2DummyData"
  top: "DummyData63"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData64"
  type: "Ara2DummyData"
  top: "DummyData64"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData65"
  type: "Ara2DummyData"
  top: "DummyData65"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData66"
  type: "Ara2DummyData"
  top: "DummyData66"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData67"
  type: "Ara2DummyData"
  top: "DummyData67"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData68"
  type: "Ara2DummyData"
  top: "DummyData68"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData69"
  type: "Ara2DummyData"
  top: "DummyData69"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData7"
  type: "Ara2DummyData"
  top: "DummyData7"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData70"
  type: "Ara2DummyData"
  top: "DummyData70"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData71"
  type: "Ara2DummyData"
  top: "DummyData71"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData72"
  type: "Ara2DummyData"
  top: "DummyData72"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData73"
  type: "Ara2DummyData"
  top: "DummyData73"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData74"
  type: "Ara2DummyData"
  top: "DummyData74"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData75"
  type: "Ara2DummyData"
  top: "DummyData75"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData76"
  type: "Ara2DummyData"
  top: "DummyData76"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData77"
  type: "Ara2DummyData"
  top: "DummyData77"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData78"
  type: "Ara2DummyData"
  top: "DummyData78"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData79"
  type: "Ara2DummyData"
  top: "DummyData79"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData8"
  type: "Ara2DummyData"
  top: "DummyData8"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData80"
  type: "Ara2DummyData"
  top: "DummyData80"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData81"
  type: "Ara2DummyData"
  top: "DummyData81"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData82"
  type: "Ara2DummyData"
  top: "DummyData82"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData83"
  type: "Ara2DummyData"
  top: "DummyData83"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData84"
  type: "Ara2DummyData"
  top: "DummyData84"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData85"
  type: "Ara2DummyData"
  top: "DummyData85"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData86"
  type: "Ara2DummyData"
  top: "DummyData86"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData87"
  type: "Ara2DummyData"
  top: "DummyData87"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData88"
  type: "Ara2DummyData"
  top: "DummyData88"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData89"
  type: "Ara2DummyData"
  top: "DummyData89"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData9"
  type: "Ara2DummyData"
  top: "DummyData9"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData90"
  type: "Ara2DummyData"
  top: "DummyData90"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData91"
  type: "Ara2DummyData"
  top: "DummyData91"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData92"
  type: "Ara2DummyData"
  top: "DummyData92"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData93"
  type: "Ara2DummyData"
  top: "DummyData93"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData94"
  type: "Ara2DummyData"
  top: "DummyData94"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData95"
  type: "Ara2DummyData"
  top: "DummyData95"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData96"
  type: "Ara2DummyData"
  top: "DummyData96"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData97"
  type: "Ara2DummyData"
  top: "DummyData97"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData98"
  type: "Ara2DummyData"
  top: "DummyData98"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "DummyData99"
  type: "Ara2DummyData"
  top: "DummyData99"
  base_type: "DummyData"
  estimator_group: "DummyData"
  dummy_data_param {
    shape {
      dim: 1
      dim: 32
      dim: 256
      dim: 64
    }
  }
}
layer {
  name: "_model_embed_tokens_Gather"
  type: "Ara2Embedding"
  bottom: "input_ids"
  top: "_model_embed_tokens_Gather"
  base_type: "Embedding"
  estimator_group: "Embedding"
  embedding_param {
    input_dim: 151872
    output_dim: 4096
  }
}
layer {
  name: "_model_layers_0_input_layernorm_Mul_1_ara_reshape_0"
  type: "Ara2Reshape"
  bottom: "_model_embed_tokens_Gather"
  top: "_model_layers_0_input_layernorm_Mul_1_ara_reshape_0"
  base_type: "Reshape"
  estimator_group: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 256
      dim: 1
      dim: 4096
    }
  }
}
layer {
  name: "_model_layers_0_input_layernorm_Mul_1_ara_LayerNorm_0"
  type: "Ara2LayerNorm"
  bottom: "_model_layers_0_input_layernorm_Mul_1_ara_reshape_0"
  top: "_model_layers_0_input_layernorm_Mul_1_ara_LayerNorm_0"
  base_type: "LayerNorm"
  estimator_group: "LayerNorm"
  layer_norm_param {
    axis: 3
    eps: 1e-06
    output_mean_var: false
    uses_mean: false
  }
}
layer {
  name: "_model_layers_0_input_layernorm_Mul_1_ara_reshape_2"
  type: "Ara2Reshape"
  bottom: "_model_layers_0_input_layernorm_Mul_1_ara_LayerNorm_0"
  top: "_model_layers_0_input_layernorm_Mul_1_ara_reshape_2"
  base_type: "Reshape"
  estimator_group: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 4096
    }
  }
}
layer {
  name: "_model_layers_0_input_layernorm_Mul_1_ara_permute_nnp_0"
  type: "Ara2PermuteNnp"
  bottom: "_model_layers_0_input_layernorm_Mul_1_ara_reshape_2"
  top: "_model_layers_0_input_layernorm_Mul_1_ara_permute_nnp_0"
  base_type: "PermuteNnp"
  estimator_group: "PermuteNnp"
  permute_nnp_param {
    order: 0
    order: 1
    order: 3
    order: 2
  }
}
layer {
  name: "_model_layers_0_input_layernorm_Mul_1"
  type: "Ara2Reshape"
  bottom: "_model_layers_0_input_layernorm_Mul_1_ara_permute_nnp_0"
  top: "_model_layers_0_input_layernorm_Mul_1"
  base_type: "Reshape"
  estimator_group: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 4096
      dim: 1
      dim: 256
    }
  }
}
layer {
  name: "_model_layers_0_self_attn_k_proj_MatMul"
  type: "Ara2Convolution"
  bottom: "_model_layers_0_input_layernorm_Mul_1"
  top: "_model_layers_0_self_attn_k_proj_MatMul"
  base_type: "Convolution"
  estimator_group: "Convolution"
  convolution_param {
    num_output: 4096
    bias_term: false
    kernel_size: 1
    kernel_size: 1
  }
}
layer {
  name: "_model_layers_0_self_attn_k_proj_Add_original_bnorm"
  type: "Ara2BatchNorm"
  bottom: "_model_layers_0_self_attn_k_proj_MatMul"
  top: "_model_layers_0_self_attn_k_proj_Add_original_bnorm"
  base_type: "BatchNorm"
  estimator_group: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0
  }
}
layer {
  name: "_model_layers_0_self_attn_k_proj_Add_original"
  type: "Ara2Scale"
  bottom: "_model_layers_0_self_attn_k_proj_Add_original_bnorm"
  top: "_model_layers_0_self_attn_k_proj_Add_original"
  base_type: "Scale"
  estimator_group: "Scale"
  scale_param {
    axis: 1
    bias_term: true
  }
}
layer {
  name: "_model_layers_0_self_attn_Reshape_1"
  type: "Ara2Reshape"
  bottom: "_model_layers_0_self_attn_k_proj_Add_original"
  top: "_model_layers_0_self_attn_Reshape_1"
  base_type: "Reshape"
  estimator_group: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 32
      dim: 128
      dim: 256
    }
  }
}
layer {
  name: "_model_layers_0_self_attn_Transpose_1"
  type: "Ara2PermuteNnp"
  bottom: "_model_layers_0_self_attn_Reshape_1"
  top: "_model_layers_0_self_attn_Transpose_1"
  base_type: "PermuteNnp"
  estimator_group: "PermuteNnp"
  permute_nnp_param {
    order: 0
    order: 1
    order: 3
    order: 2
  }
}
layer {
  name: "_model_layers_0_self_attn_Slice_2"
  type: "Ara2Crop"
  bottom: "_model_layers_0_self_attn_Transpose_1"
  bottom: "DummyData1"
  top: "_model_layers_0_self_attn_Slice_2"
  base_type: "Crop"
  estimator_group: "Crop"
  crop_param {
    axis: 0
    offset: 0
    offset: 0
    offset: 0
    offset: 0
  }
}
layer {
  name: "_model_layers_0_self_attn_Concat_1custom_ara_dvshift_1"
  type: "Ara2DVShift"
  bottom: "_model_layers_0_self_attn_Slice_2"
  top: "_model_layers_0_self_attn_Concat_1custom_ara_dvshift_1"
  base_type: "DVShift"
  estimator_group: "DVShift"
  dvshift_param {
    shift: 0
  }
}
layer {
  name: "_model_layers_0_self_attn_Slice_3"
  type: "Ara2Crop"
  bottom: "_model_layers_0_self_attn_Transpose_1"
  bottom: "DummyData2"
  top: "_model_layers_0_self_attn_Slice_3"
  base_type: "Crop"
  estimator_group: "Crop"
  crop_param {
    axis: 0
    offset: 0
    offset: 0
    offset: 0
    offset: 64
  }
}
layer {
  name: "_model_layers_0_self_attn_Neg_1"
  type: "Onnx_Neg"
  bottom: "_model_layers_0_self_attn_Slice_3"
  top: "_model_layers_0_self_attn_Neg_1"
  base_type: "Onnx_Neg"
  estimator_group: "Onnx_Neg"
}
layer {
  name: "_model_layers_0_self_attn_Concat_1custom_ara_dvshift_0"
  type: "Ara2DVShift"
  bottom: "_model_layers_0_self_attn_Neg_1"
  top: "_model_layers_0_self_attn_Concat_1custom_ara_dvshift_0"
  base_type: "DVShift"
  estimator_group: "DVShift"
  dvshift_param {
    shift: 0
  }
}
layer {
  name: "_model_layers_0_self_attn_Concat_1"
  type: "Ara2Concat"
  bottom: "_model_layers_0_self_attn_Concat_1custom_ara_dvshift_0"
  bottom: "_model_layers_0_self_attn_Concat_1custom_ara_dvshift_1"
  top: "_model_layers_0_self_attn_Concat_1"
  base_type: "Concat"
  estimator_group: "Concat"
  concat_param {
    axis: 3
  }
}
layer {
  name: "_model_layers_0_self_attn_q_proj_MatMul"
  type: "Ara2Convolution"
  bottom: "_model_layers_0_input_layernorm_Mul_1"
  top: "_model_layers_0_self_attn_q_proj_MatMul"
  base_type: "Convolution"
  estimator_group: "Convolution"
  convolution_param {
    num_output: 4096
    bias_term: false
    kernel_size: 1
    kernel_size: 1
  }
}
layer {
  name: "_model_layers_0_self_attn_q_proj_Add_original_bnorm"
  type: "Ara2BatchNorm"
  bottom: "_model_layers_0_self_attn_q_proj_MatMul"
  top: "_model_layers_0_self_attn_q_proj_Add_original_bnorm"
  base_type: "BatchNorm"
  estimator_group: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0
  }
}
layer {
  name: "_model_layers_0_self_attn_q_proj_Add_original"
  type: "Ara2Scale"
  bottom: "_model_layers_0_self_attn_q_proj_Add_original_bnorm"
  top: "_model_layers_0_self_attn_q_proj_Add_original"
  base_type: "Scale"
  estimator_group: "Scale"
  scale_param {
    axis: 1
    bias_term: true
  }
}
layer {
  name: "_model_layers_0_self_attn_Reshape"
  type: "Ara2Reshape"
  bottom: "_model_layers_0_self_attn_q_proj_Add_original"
  top: "_model_layers_0_self_attn_Reshape"
  base_type: "Reshape"
  estimator_group: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 32
      dim: 128
      dim: 256
    }
  }
}
layer {
  name: "_model_layers_0_self_attn_Transpose"
  type: "Ara2PermuteNnp"
  bottom: "_model_layers_0_self_attn_Reshape"
  top: "_model_layers_0_self_attn_Transpose"
  base_type: "PermuteNnp"
  estimator_group: "PermuteNnp"
  permute_nnp_param {
    order: 0
    order: 1
    order: 3
    order: 2
  }
}
layer {
  name: "_model_layers_0_self_attn_Slice"
  type: "Ara2Crop"
  bottom: "_model_layers_0_self_attn_Transpose"
  bottom: "DummyData3"
  top: "_model_layers_0_self_attn_Slice"
  base_type: "Crop"
  estimator_group: "Crop"
  crop_param {
    axis: 0
    offset: 0
    offset: 0
    offset: 0
    offset: 0
  }
}
layer {
  name: "_model_layers_0_self_attn_Concatcustom_ara_dvshift_1"
  type: "Ara2DVShift"
  bottom: "_model_layers_0_self_attn_Slice"
  top: "_model_layers_0_self_attn_Concatcustom_ara_dvshift_1"
  base_type: "DVShift"
  estimator_group: "DVShift"
  dvshift_param {
    shift: 0
  }
}
layer {
  name: "_model_layers_0_self_attn_Slice_1"
  type: "Ara2Crop"
  bottom: "_model_layers_0_self_attn_Transpose"
  bottom: "DummyData4"
  top: "_model_layers_0_self_attn_Slice_1"
  base_type: "Crop"
  estimator_group: "Crop"
  crop_param {
    axis: 0
    offset: 0
    offset: 0
    offset: 0
    offset: 64
  }
}
layer {
  name: "_model_layers_0_self_attn_Neg"
  type: "Onnx_Neg"
  bottom: "_model_layers_0_self_attn_Slice_1"
  top: "_model_layers_0_self_attn_Neg"
  base_type: "Onnx_Neg"
  estimator_group: "Onnx_Neg"
}
layer {
  name: "_model_layers_0_self_attn_Concatcustom_ara_dvshift_0"
  type: "Ara2DVShift"
  bottom: "_model_layers_0_self_attn_Neg"
  top: "_model_layers_0_self_attn_Concatcustom_ara_dvshift_0"
  base_type: "DVShift"
  estimator_group: "DVShift"
  dvshift_param {
    shift: 0
  }
}
layer {
  name: "_model_layers_0_self_attn_Concat"
  type: "Ara2Concat"
  bottom: "_model_layers_0_self_attn_Concatcustom_ara_dvshift_0"
  bottom: "_model_layers_0_self_attn_Concatcustom_ara_dvshift_1"
  top: "_model_layers_0_self_attn_Concat"
  base_type: "Concat"
  estimator_group: "Concat"
  concat_param {
    axis: 3
  }
}
layer {
  name: "_model_layers_0_self_attn_v_proj_MatMul"
  type: "Ara2Convolution"
  bottom: "_model_layers_0_input_layernorm_Mul_1"
  top: "_model_layers_0_self_attn_v_proj_MatMul"
  base_type: "Convolution"
  estimator_group: "Convolution"
  convolution_param {
    num_output: 4096
    bias_term: false
    kernel_size: 1
    kernel_size: 1
  }
}
layer {
  name: "_model_layers_0_self_attn_v_proj_Add_original_bnorm"
  type: "Ara2BatchNorm"
  bottom: "_model_layers_0_self_attn_v_proj_MatMul"
  top: "_model_layers_0_self_attn_v_proj_Add_original_bnorm"
  base_type: "BatchNorm"
  estimator_group: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0
  }
}
layer {
  name: "_model_layers_0_self_attn_v_proj_Add_original"
  type: "Ara2Scale"
  bottom: "_model_layers_0_self_attn_v_proj_Add_original_bnorm"
  top: "_model_layers_0_self_attn_v_proj_Add_original"
  base_type: "Scale"
  estimator_group: "Scale"
  scale_param {
    axis: 1
    bias_term: true
  }
}
layer {
  name: "_model_layers_0_self_attn_Reshape_2"
  type: "Ara2Reshape"
  bottom: "_model_layers_0_self_attn_v_proj_Add_original"
  top: "_model_layers_0_self_attn_Reshape_2"
  base_type: "Reshape"
  estimator_group: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 32
      dim: 128
      dim: 256
    }
  }
}
layer {
  name: "_model_layers_0_self_attn_Transpose_2"
  type: "Ara2PermuteNnp"
  bottom: "_model_layers_0_self_attn_Reshape_2"
  top: "_model_layers_0_self_attn_Transpose_2"
  base_type: "PermuteNnp"
  estimator_group: "PermuteNnp"
  permute_nnp_param {
    order: 0
    order: 1
    order: 3
    order: 2
  }
}
layer {
  name: "_model_layers_0_self_attn_Gather"
  type: "Ara2Embedding"
  bottom: "position_ids"
  top: "_model_layers_0_self_attn_Gather"
  base_type: "Embedding"
  estimator_group: "Embedding"
  embedding_param {
    input_dim: 256
    output_dim: 128
  }
}
layer {
  name: "_model_layers_0_self_attn_Gather_1"
  type: "Ara2Embedding"
  bottom: "position_ids"
  top: "_model_layers_0_self_attn_Gather_1"
  base_type: "Embedding"
  estimator_group: "Embedding"
  embedding_param {
    input_dim: 256
    output_dim: 128
  }
}
layer {
  name: "_model_layers_0_self_attn_Unsqueeze"
  type: "Ara2Reshape"
  bottom: "_model_layers_0_self_attn_Gather"
  top: "_model_layers_0_self_attn_Unsqueeze"
  base_type: "Reshape"
  estimator_group: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 128
    }
  }
}
layer {
  name: "_model_layers_0_self_attn_Mul"
  type: "Ara2Eltwise"
  bottom: "_model_layers_0_self_attn_Transpose"
  bottom: "_model_layers_0_self_attn_Unsqueeze"
  top: "_model_layers_0_self_attn_Mul"
  base_type: "Eltwise"
  estimator_group: "Eltwise"
  eltwise_param {
    operation: PROD
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast1: 0.0
    broadcast1: 1.0
    broadcast1: 0.0
    broadcast1: 0.0
  }
}
layer {
  name: "_model_layers_0_self_attn_Mul_2"
  type: "Ara2Eltwise"
  bottom: "_model_layers_0_self_attn_Transpose_1"
  bottom: "_model_layers_0_self_attn_Unsqueeze"
  top: "_model_layers_0_self_attn_Mul_2"
  base_type: "Eltwise"
  estimator_group: "Eltwise"
  eltwise_param {
    operation: PROD
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast1: 0.0
    broadcast1: 1.0
    broadcast1: 0.0
    broadcast1: 0.0
  }
}
layer {
  name: "_model_layers_0_self_attn_Unsqueeze_1"
  type: "Ara2Reshape"
  bottom: "_model_layers_0_self_attn_Gather_1"
  top: "_model_layers_0_self_attn_Unsqueeze_1"
  base_type: "Reshape"
  estimator_group: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 1
      dim: 256
      dim: 128
    }
  }
}
layer {
  name: "_model_layers_0_self_attn_Mul_1"
  type: "Ara2Eltwise"
  bottom: "_model_layers_0_self_attn_Concat"
  bottom: "_model_layers_0_self_attn_Unsqueeze_1"
  top: "_model_layers_0_self_attn_Mul_1"
  base_type: "Eltwise"
  estimator_group: "Eltwise"
  eltwise_param {
    operation: PROD
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast1: 0.0
    broadcast1: 1.0
    broadcast1: 0.0
    broadcast1: 0.0
  }
}
layer {
  name: "_model_layers_0_self_attn_Add"
  type: "Ara2Eltwise"
  bottom: "_model_layers_0_self_attn_Mul"
  bottom: "_model_layers_0_self_attn_Mul_1"
  top: "_model_layers_0_self_attn_Add"
  base_type: "Eltwise"
  estimator_group: "Eltwise"
  eltwise_param {
    operation: SUM
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast1: 0.0
    broadcast1: 0.0
    broadcast1: 0.0
    broadcast1: 0.0
  }
}
layer {
  name: "_model_layers_0_self_attn_Mul_3"
  type: "Ara2Eltwise"
  bottom: "_model_layers_0_self_attn_Concat_1"
  bottom: "_model_layers_0_self_attn_Unsqueeze_1"
  top: "_model_layers_0_self_attn_Mul_3"
  base_type: "Eltwise"
  estimator_group: "Eltwise"
  eltwise_param {
    operation: PROD
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast1: 0.0
    broadcast1: 1.0
    broadcast1: 0.0
    broadcast1: 0.0
  }
}
layer {
  name: "_model_layers_0_self_attn_Add_1"
  type: "Ara2Eltwise"
  bottom: "_model_layers_0_self_attn_Mul_2"
  bottom: "_model_layers_0_self_attn_Mul_3"
  top: "_model_layers_0_self_attn_Add_1"
  base_type: "Eltwise"
  estimator_group: "Eltwise"
  eltwise_param {
    operation: SUM
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast0: 0.0
    broadcast1: 0.0
    broadcast1: 0.0
    broadcast1: 0.0
    broadcast1: 0.0
  }
}
layer {
  name: "_model_layers_0_self_attn_Mul_4_bnorm"
  type: "Ara2BatchNorm"
  bottom: "_model_layers_0_self_attn_Add"
  top: "_model_layers_0_self_attn_Mul_4_bnorm"
  base_type: "BatchNorm"
  estimator_group: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0
  }
}
layer {
  name: "_model_layers_0_self_attn_Mul_4"
  type: "Ara2Scale"
  bottom: "_model_layers_0_self_attn_Mul_4_bnorm"
  top: "_model_layers_0_self_attn_Mul_4"
  base_type: "Scale"
  estimator_group: "Scale"
  scale_param {
    axis: 1
    bias_term: true
  }
}
layer {
  name: "_model_layers_0_self_attn_MatMul_ara_permute_nnp_0"
  type: "Ara2PermuteNnp"
  bottom: "_model_layers_0_self_attn_Mul_4"
  top: "_model_layers_0_self_attn_MatMul_ara_permute_nnp_0"
  base_type: "PermuteNnp"
  estimator_group: "PermuteNnp"
  permute_nnp_param {
    order: 0
    order: 1
    order: 3
    order: 2
  }
}
layer {
  name: "_model_layers_0_self_attn_Transpose_3"
  type: "Ara2PermuteNnp"
  bottom: "_model_layers_0_self_attn_Add_1"
  top: "_model_layers_0_self_attn_Transpose_3"
  base_type: "PermuteNnp"
  estimator_group: "PermuteNnp"
  permute_nnp_param {
    order: 0
    order: 1
    order: 3
    order: 2
  }
}
layer {
  name: "_model_layers_0_self_attn_Mul_5_bnorm"
  type: "Ara2BatchNorm"
  bottom: "_model_layers_0_self_attn_Transpose_3"
  top: "_model_layers_0_self_attn_Mul_5_bnorm"
  base_type: "BatchNorm"
  estimator_group: "BatchNorm"
  batch_norm_param {
    use_global_stats: true
    eps: 0.0
  }
}
layer {
  name: "_model_layers_0_self_attn_Mul_5"
  type: "Ara2Scale"
  bottom: "_model_layers_0_self_attn_Mul_5_bnorm"
  top: "_model_layers_0_self_attn_Mul_5"
  base_type: "Scale"
  estimator_group: "Scale"
  scale_param {
    axis: 1
    bias_term: true
  }
}
layer {
  name: "_model_layers_0_self_attn_MatMul"
  type: "Ara2BatchDot"
  bottom: "_model_layers_0_self_attn_MatMul_ara_permute_nnp_0"
  bottom: "_model_layers_0_self_attn_Mul_5"
  top: "_model_layers_0_self_attn_MatMul"
  base_type: "BatchDot"
  estimator_group: "BatchDot"
  batch_dot_param {
    transpose_a: 1
    transpose_b: 0
  }
}
layer {
  name: "_model_layers_0_self_attn_Softmax"
  type: "Ara2AttentionSoftmax"
  bottom: "_model_layers_0_self_attn_MatMul"
  bottom: "_model_Where_3_output_0"
  top: "_model_layers_0_self_attn_Softmax"
  base_type: "AttentionSoftmax"
  estimator_group: "AttentionSoftmax"
  attentionsoftmax_param {
    axis: 3
  }
}
layer {
  name: "_model_layers_0_self_attn_MatMul_1_ara_permute_nnp_0"
  type: "Ara2PermuteNnp"
  bottom: "_model_layers_0_self_attn_Softmax"
  top: "_model_layers_0_self_attn_MatMul_1_ara_permute_nnp_0"
  base_type: "PermuteNnp"
  estimator_group: "PermuteNnp"
  permute_nnp_param {
    order: 0
    order: 1
    order: 3
    order: 2
  }
}
layer {
  name: "_model_layers_0_self_attn_MatMul_1"
  type: "Ara2BatchDot"
  bottom: "_model_layers_0_self_attn_Transpose_2"
  bottom: "_model_layers_0_self_attn_MatMul_1_ara_permute_nnp_0"
  top: "_model_layers_0_self_attn_MatMul_1"
  base_type: "BatchDot"
  estimator_group: "BatchDot"
  batch_dot_param {
    transpose_a: 1
    transpose_b: 0
  }
}
layer {
  name: "_model_layers_0_self_attn_o_proj_MatMul_ara_reshape_0"
  type: "Ara2Reshape"
  bottom: "_model_layers_0_self_attn_MatMul_1"
  top: "_model_layers_0_self_attn_o_proj_MatMul_ara_reshape_0"
  base_type: "Reshape"
  estimator_group: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 4096
      dim: 1
      dim: 256
    }
  }
}
layer {
  name: "_model_layers_0_self_attn_o_proj_MatMul_ara_inrp"
  type: "Ara2Convolution"
  bottom: "_model_layers_0_self_attn_o_proj_MatMul_ara_reshape_0"
  top: "_model_layers_0_self_attn_o_proj_MatMul_ara_inrp"
  base_type: "Convolution"
  estimator_group: "Convolution"
  convolution_param {
    num_output: 4096
    bias_term: false
    kernel_size: 1
    kernel_size: 1
  }
}
layer {
  name: "_model_layers_0_self_attn_o_proj_MatMul_ara_reshape_1"
  type: "Ara2Reshape"
  bottom: "_model_layers_0_self_attn_o_proj_MatMul_ara_inrp"
  top: "_model_layers_0_self_attn_o_proj_MatMul_ara_reshape_1"
  base_type: "Reshape"
  estimator_group: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 1
      dim: 4096
      dim: 256
    }
  }
}
layer {
  name: "_model_layers_0_self_attn_o_proj_MatMul_ara_permute_nnp_0"
  type: "Ara2PermuteNnp"
  bottom: "_model_layers_0_self_attn_o_proj_MatMul_ara_reshape_1"
  top: "_model_layers_0_self_attn_o_proj_MatMul_ara_permute_nnp_0"
  base_type: "PermuteNnp"
  estimator_group: "PermuteNnp"
  permute_nnp_param {
    order: 0
    order: 1
    order: 3
    order: 2
  }
}
layer {
  name: "_model_layers_0_self_attn_o_proj_MatMul"
  type: "Ara2Reshape"
  bottom: "_model_layers_0_self_attn_o_proj_MatMul_ara_permute_nnp_0"
  top: "_model_layers_0_self_attn_o_proj_MatMul"
  base_type: "Reshape"
  estimator_group: "Reshape"
  reshape_param {
    shape {
      dim: 1
      dim: 256
      dim: 4096
    }
  }
}
layer {
  name: "_model_layers_0_Add"
  type: "Ara2Eltwise"
  bottom: "_model_embed_tokens_Gather"
  bottom: "_model_layers_0_self_attn_o_proj_MatMul"
